# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [23]:
baby_names = pd.read_csv("https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv",sep=",")
baby_names.shape

(1016395, 7)

### Step 4. See the first 10 entries

In [24]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [25]:
cols = [0,1]

baby_names.drop(baby_names.columns[cols],axis=1,inplace=True)
baby_names.head(10)

       Name  Year Gender State  Count
0      Emma  2004      F    AK     62
1   Madison  2004      F    AK     48
2    Hannah  2004      F    AK     46
3     Grace  2004      F    AK     44
4     Emily  2004      F    AK     41
5   Abigail  2004      F    AK     37
6    Olivia  2004      F    AK     33
7  Isabella  2004      F    AK     30
8    Alyssa  2004      F    AK     29
9    Sophia  2004      F    AK     28

### Step 6. Is there more male or female names in the dataset?

In [26]:
baby_names.groupby(baby_names.Gender).count().Count

Gender
F    558846
M    457549
Name: Count, dtype: int64

### Step 7. Group the dataset by name and assign to names

baby_names.drop(baby_names.columns[1],axis=1,inplace=True)
names = baby_names.groupby(baby_names.Name)

### Step 8. How many different names exist in the dataset?

In [29]:
len(names.nunique())

17632

### Step 9. What is the name with most occurrences?

In [36]:
names.Count.idxmax()

Name
Aaban      693699
Aadan      120728
Aadarsh    323950
Aaden      121886
Aadhav     138429
            ...
Zyra       884656
Zyrah      881583
Zyren      910625
Zyria      237366
Zyriah     862166
Name: Count, Length: 17632, dtype: int64

### Step 10. How many different names have the least occurrences?

In [37]:
names.Count.idxmin()

Name
Aaban      693699
Aadan      138678
Aadarsh    323950
Aaden       17728
Aadhav     138429
            ...
Zyra       103431
Zyrah       95392
Zyren      910625
Zyria      243106
Zyriah     235986
Name: Count, Length: 17632, dtype: int64

### Step 11. What is the median name occurrence?

### Step 12. What is the standard deviation of names?

In [38]:
names.Count.std()

Name
Aaban       0.000000
Aadan       0.957427
Aadarsh          NaN
Aaden      21.154974
Aadhav           NaN
             ...
Zyra        1.154701
Zyrah       0.707107
Zyren            NaN
Zyria       0.737865
Zyriah      1.666667
Name: Count, Length: 17632, dtype: float64

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [ ]:
names.describe()